/*
题目：有一个已经排好序的数组。现输入一个数，要求按原来的规律将它插入数组中。

程序分析：首先判断此数是否大于最后一个数，然后再考虑插入中间的数的情况，插入后此元素之后的数，依次后移一个位置。
 */
fn main() {
    println!("Hello, world!");

    // let mut x = vec![1, 3, 3, 3, 4, 4, 4, 4, 5, 5, 5, 6, 6, 23, 23, 32, 34, 35, 43];
    let mut x = vec![43, 35, 34, 32, 23, 23, 6, 6, 5, 5, 5, 4, 4, 4, 4, 3, 3, 3, 1];

    let n = 21;

    for i in 1..x.len() {
        if (x[i - 1] >= n && x[i] <= n) || (x[i - 1] <= n && x[i] >= n) {
            // 找到位置 i
            x.push(0);
            for j in ((i + 1)..(x.len() - 1)).rev() {
                x[j + 1] = x[j];
            }
            x[i] = n;
            break;
        }
    }

    println!("{:?}", x);
}
